app/views/clientes/index.html.erb

    <% if params[:busca].present? || clientes_filtros_ativos? %>
      <%= pluralize(@clientes.size, "cliente encontrado", "clientes encontrados") %>
---
SELECT "clientes".* FROM "clientes" ORDER BY "clientes"."created_at" DESC