app/views/dashboard/index.html.erb

SELECT COUNT(*) FROM "clientes"
---
  <div class="mb-8 grid grid-cols-1 items-start gap-6 md:grid-cols-2 lg:grid-cols-4">
    <% [
      { label: "Total de Clientes", value: @total_clientes, border: "border-emerald-500", icon_bg: "bg-emerald-100", icon_color: "text-emerald-600", icon: ui_icon_path(:clientes) },
      { label: "Resultado do Mês", value: format_currency(@saldo_mes), border: @saldo_mes >= 0 ? "border-emerald-500" : "border-red-500", icon_bg: @saldo_mes >= 0 ? "bg-emerald-100" : "bg-red-100", icon_color: @saldo_mes >= 0 ? "text-emerald-600" : "text-red-600", icon: ui_icon_path(:financeiro), value_class: @saldo_mes >= 0 ? "text-emerald-600" : "text-red-600" },
      { label: "Itens em Estoque", value: @total_produtos, border: "border-amber-400", icon_bg: "bg-amber-100", icon_color: "text-amber-600", icon: ui_icon_path(:estoque), extra: @produtos_baixo_estoque > 0 ? "#{@produtos_baixo_estoque} com estoque baixo" : nil },
      { label: "Manutenções Pendentes", value: @manutencoes_pendentes, border: "border-red-400", icon_bg: "bg-red-100", icon_color: "text-red-600", icon: ui_icon_path(:manutencao) }
    ].each do |card| %>