app/views/estoque/index.html.erb

<div class="mb-5 flex flex-wrap items-center gap-2">
  <%= ui_badge_count(estoque_filtros_ativos? ? pluralize(@produtos.size, "produto encontrado", "produtos encontrados") : "Total de #{pluralize(@produtos.size, 'produto', 'produtos')}") %>
---
SELECT COUNT(*) FROM "produtos" WHERE (quantidade <= valor_minimo)