app/views/manutencao/index.html.erb

SELECT COUNT(*) FROM "manutencaos"
---
      hint: "Manutenções finalizadas" %>
  <%= render "shared/metric_card",
      label: "Exibidos",
      value: @manutencoes.count,
      accent: :neutral,
      icon_path: ui_icon_path(:manutencao),
      hint: manutencao_filtros_ativos? ? "Com filtros aplicados na lista" : "Total de registros" %>