app/controllers/clientes_controller.rb

SELECT "mesas_de_bilhar".* FROM "mesas_de_bilhar" WHERE "mesas_de_bilhar"."cliente_id" = 3 ORDER BY "mesas_de_bilhar"."ordem" ASC
---
  def destroy
    session[:deleted_cliente] = {
      "cliente" => @cliente.attributes.slice("nome", "telefone", "email", "observacoes"),
      "mesas" => @cliente.mesas_de_bilhar.map { |m| m.attributes.slice("ordem", "numeracao", "registros") }

SELECT "clientes".* FROM "clientes" ORDER BY "clientes"."created_at" DESC
---
    scope = Cliente.all