app/controllers/clientes_controller.rb

  def destroy
    @cliente.destroy
---
DELETE FROM "clientes" WHERE "clientes"."id" = 5