app/controllers/dashboard_controller.rb

SELECT COUNT(*) FROM "clientes"
SELECT COUNT(*) FROM "produtos" WHERE (quantidade <= valor_minimo)
SELECT COUNT(*) FROM "produtos"
---
  def index
    @ultima_atualizacao = Time.current

    @total_clientes = Cliente.count
    @total_produtos = Produto.count
    @produtos_baixo_estoque = Produto.baixo_estoque.count

SELECT COUNT(*) FROM "manutencaos" WHERE "manutencaos"."status" = 'pendente'
SELECT "clientes".* FROM "clientes" ORDER BY "clientes"."created_at" DESC LIMIT 5
---
      .to_h

    @status_manutencoes = {
      "Pendente"     => Manutencao.where(status: "pendente").count,
      "Em andamento" => Manutencao.where(status: "em_andamento").count,
      "Concluída"    => Manutencao.where(status: "concluida").count,
      "Cancelada"    => Manutencao.where(status: "cancelada").count
    }

    @ultimas_transacoes = TransacaoFinanceira.recentes.limit(5)
    @ultimos_clientes = Cliente.recentes.limit(5)