app/controllers/estoque_controller.rb

SELECT "produtos".* FROM "produtos" ORDER BY "produtos"."nome" ASC
SELECT DISTINCT "produtos"."categoria" FROM "produtos"
---
  def index
    @produtos = if params[:busca].present?
      Produto.buscar(params[:busca])
    elsif params[:categoria].present?
      Produto.por_categoria(params[:categoria])
    else
      Produto.all.order(:nome)
    end
    @produtos_baixo_estoque = Produto.baixo_estoque
    @categorias = Produto.distinct.pluck(:categoria).compact

DELETE FROM "produtos" WHERE "produtos"."id" = 3
---
  def destroy
    @produto.destroy

SELECT "produtos".* FROM "produtos" WHERE "produtos"."id" = 5 LIMIT 1
---
  def set_produto
    @produto = Produto.find(params[:id])