app/controllers/financeiro_controller.rb

SELECT "transacao_financeiras".* FROM "transacao_financeiras" WHERE "transacao_financeiras"."id" = 5 LIMIT 1
---
  def set_transacao
    @transacao = TransacaoFinanceira.find(params[:id])