app/controllers/financeiro_controller.rb

SELECT DISTINCT "transacao_financeiras"."categoria" FROM "transacao_financeiras"
---
  def index
    @transacoes = TransacaoFinanceira.lista_filtrada(params)

    mes_atual = Date.current.month
    ano_atual = Date.current.year
    @receitas_mes = TransacaoFinanceira.receitas.por_mes(ano_atual, mes_atual).sum(:valor)
    @despesas_mes = TransacaoFinanceira.despesas.por_mes(ano_atual, mes_atual).sum(:valor)
    @saldo_mes = @receitas_mes - @despesas_mes

    @receitas_total = TransacaoFinanceira.receitas.sum(:valor)
    @despesas_total = TransacaoFinanceira.despesas.sum(:valor)
    @saldo_total = @receitas_total - @despesas_total

    @categorias = TransacaoFinanceira.distinct.pluck(:categoria).compact

UPDATE "transacao_financeiras" SET "updated_at" = '2026-04-13 18:24:44.054432', "valor" = 1200.0 WHERE "transacao_financeiras"."id" = 5
---
  def update
    if respond_with_modal_save(
      success: @transacao.update(transacao_params),
      redirect_path: financeiro_index_path,
      notice: "Transação atualizada com sucesso!",
      tbody_id: "financeiro_tbody",
      partial: "financeiro/tbody",
      locals: { transacoes: TransacaoFinanceira.lista_filtrada(params) }
    )

SELECT "transacao_financeiras".* FROM "transacao_financeiras" WHERE "transacao_financeiras"."id" = 5 LIMIT 1
---
  def set_transacao
    @transacao = TransacaoFinanceira.find(params[:id])