app/controllers/manutencao_controller.rb

SELECT COUNT(*) FROM "manutencaos"
SELECT DISTINCT "manutencaos"."equipamento" FROM "manutencaos"
---
  def index
    @manutencoes = if params[:status].present?
      Manutencao.where(status: params[:status]).recentes
    elsif params[:equipamento].present?
      Manutencao.por_equipamento(params[:equipamento]).recentes
    else
      Manutencao.recentes
    end

    @pendentes = Manutencao.pendentes.count
    @em_andamento = Manutencao.em_andamento.count
    @concluidas = Manutencao.concluidas.count
    @equipamentos = Manutencao.distinct.pluck(:equipamento).compact

SELECT "manutencaos".* FROM "manutencaos" WHERE "manutencaos"."id" = 4 LIMIT 1
---
  def set_manutencao
    @manutencao = Manutencao.find(params[:id])