app/controllers/mesas_de_bilhar_controller.rb

  def create
    @mesa = @cliente.mesas_de_bilhar.build(mesa_params)
    if respond_with_modal_save(
      success: @mesa.save,
      redirect_path: clientes_path,
      notice: "Mesa de bilhar cadastrada com sucesso.",
      tbody_id: "clientes_tbody",
      partial: "clientes/tbody",
      locals: { clientes: Cliente.lista_filtrada(params) }
    )
---
INSERT INTO "mesas_de_bilhar" ("cliente_id", "ordem", "numeracao", "registros", "created_at", "updated_at") VALUES (3, 1, '300', 1213123, '2026-04-13 20:49:14.664339', '2026-04-13 20:49:14.664339') RETURNING "id"

  def set_cliente
    @cliente = Cliente.find(params[:cliente_id])
---
SELECT "clientes".* FROM "clientes" WHERE "clientes"."id" = 3 LIMIT 1