app/controllers/sessions_controller.rb

  def create
    admin = Admin.first
---
SELECT "admins".* FROM "admins" ORDER BY "admins"."id" ASC LIMIT 1