app/models/mesa_de_bilhar.rb

SELECT MAX("mesas_de_bilhar"."ordem") FROM "mesas_de_bilhar" WHERE "mesas_de_bilhar"."cliente_id" = 3
---
  def assign_ordem
    return if ordem.present?
    return unless cliente_id

    max = MesaDeBilhar.where(cliente_id: cliente_id).maximum(:ordem)