app/controllers/concerns/authenticatable.rb

SELECT "admins".* FROM "admins" WHERE "admins"."id" = 1 LIMIT 1
---
  def current_admin
    @current_admin ||= Admin.find_by(id: session[:admin_id]) if session[:admin_id]